app/controllers/cost_items_controller.rb

  def index
    @cost_items = CostItem.all :order => 'length(seq) DESC, seq DESC'
---
SELECT * FROM "cost_items"

  def show
    @cost_item = CostItem.find(params[:id])
---
SELECT * FROM "cost_items" WHERE ("cost_items"."id" = 1)

  def edit
    @cost_item = CostItem.find(params[:id])
---
SELECT * FROM "cost_items" WHERE ("cost_items"."id" = 3)

  def create
    @cost_item = CostItem.new(params[:cost_item])

    respond_to do |format|
      if @cost_item.save
---
INSERT INTO "cost_items" ("name", "seq_no", "period", "updated_at", "price", "created_at") VALUES('租金', 1, 30, '2010-08-30 13:09:57.171000', 2100.0, '2010-08-30 13:09:57.171000') RETURNING "id"

  def update
    @cost_item = CostItem.find(params[:id])

    respond_to do |format|
      if @cost_item.update_attributes(params[:cost_item])
---
SELECT * FROM "cost_items" WHERE ("cost_items"."id" = 3)
UPDATE "cost_items" SET "period" = 30, "name" = 'elc', "price" = 900.0, "updated_at" = '2010-08-30 14:06:02.234000' WHERE "id" = 3