app/controllers/customers_controller.rb

  def index
    @customers = Customer.all :order => 'length(seq) DESC, seq DESC'
---
SELECT * FROM "customers" ORDER BY name
SELECT count(*) AS count_all FROM "orders" WHERE ("orders".customer_id = 5)

  def show
    @customer = Customer.find(params[:id])
---
SELECT * FROM "customers" WHERE ("customers"."id" = 8)

  def edit
    @customer = Customer.find(params[:id])
---
SELECT * FROM "customers" WHERE ("customers"."id" = 8)

  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("name", "updated_at", "seq_no", "created_at") VALUES('ss', '2010-09-05 09:31:25.625000', 2, '2010-09-05 09:31:25.625000') RETURNING "id"

  def update
    @customer = Customer.find(params[:id])
---
SELECT * FROM "customers" WHERE ("customers"."id" = 8)

  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy
---
SELECT * FROM "customers" WHERE ("customers"."id" = 1)
DELETE FROM "customers" WHERE "id" = 1