app/controllers/invests_controller.rb

SELECT * FROM "invests"
---
  def index
    @invests = Invest.all :order => 'date DESC, length(seq) DESC, seq DESC'

SELECT * FROM "invests" WHERE ("invests"."id" = 1)
---
  def show
    @invest = Invest.find(params[:id])

SELECT * FROM "invests" WHERE ("invests"."id" = 1)
---
  def edit
    @invest = Invest.find(params[:id])

INSERT INTO "invests" ("seq_no", "updated_at", "date", "amount", "cost_item_id", "created_at") VALUES(1, '2010-08-30 15:15:57.500000', '2010-08-30', 6300.0, 1, '2010-08-30 15:15:57.500000') RETURNING "id"
---
  def create
    @invest = Invest.new(params[:invest])

    respond_to do |format|
      if @invest.save