app/controllers/orders_controller.rb

  def new
    @order = Order.new
    @order.seq_no = Order.last.id+1
---
SELECT * FROM "orders" ORDER BY orders.id DESC LIMIT 1