app/controllers/orders_controller.rb

  def index
    if params[:criteria_order].blank?
---
SELECT * FROM "orders" WHERE ((customer_id = 1) AND (date between '2010-08-28' and '2010-08-28')) ORDER BY date DESC, seq_no DESC

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 1)

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 599)

  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("manfee", "updated_at", "seq_no", "price", "date", "product_id", "customer_id", "is_paied", "volume", "created_at") VALUES(0.0, '2010-08-28 12:52:13.906000', 555, 0.0, '2010-08-28', 8, 8, 'no', 0.0, '2010-08-28 12:52:13.906000') RETURNING "id"

  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 253)
UPDATE "orders" SET "is_paied" = 'no', "updated_at" = '2010-09-02 13:11:29.203000' WHERE "id" = 253