app/controllers/payables_controller.rb

SELECT * FROM "payables"
---
  def index
    if params[:criteria_payable].blank?

SELECT * FROM "payables" WHERE ("payables"."id" = 1)
---
  def show
    @payable = Payable.find(params[:id])

SELECT * FROM "payables" WHERE ("payables"."id" = 1)
---
  def edit
    @payable = Payable.find(params[:id])

INSERT INTO "payables" ("seq_no", "updated_at", "date", "amount", "supplier_id", "created_at") VALUES(1, '2010-08-30 16:24:02.671000', '2010-08-31', 10.0, 1, '2010-08-30 16:24:02.671000') RETURNING "id"
---
  def create
    @payable = Payable.new(params[:payable])

    respond_to do |format|
      if @payable.save

SELECT * FROM "payables" WHERE ("payables"."id" = 1)
---
  def update
    @payable = Payable.find(params[:id])