app/controllers/products_controller.rb

  def index
    @products = Product.all :order => 'length(seq) DESC, seq DESC'
---
SELECT * FROM "products" ORDER BY name
SELECT count(*) AS count_all FROM "orders" WHERE ("orders".product_id = 1)

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "updated_at", "price", "created_at") VALUES('ee', '2010-08-26 17:57:28.593000', 22.0, '2010-08-26 17:57:28.593000') RETURNING "id"