app/controllers/purchases_controller.rb

  def index
    @purchases = Purchase.all :order => 'date DESC, seq_no DESC'
---
SELECT * FROM "purchases" ORDER BY date DESC, seq_no DESC

  def show
    @purchase = Purchase.find(params[:id])
---
SELECT * FROM "purchases" WHERE ("purchases"."id" = 88)

  def edit
    @purchase = Purchase.find(params[:id])
---
SELECT * FROM "purchases" WHERE ("purchases"."id" = 88)

  def update
    @purchase = Purchase.find(params[:id])
---
SELECT * FROM "purchases" WHERE ("purchases"."id" = 88)