app/controllers/receivables_controller.rb

  def index
    if params[:criteria_receivable].blank?
      session[:criteria_receivable] ||= CriteriaReceivable.new
    else
      session[:criteria_receivable] = CriteriaReceivable.new(params[:criteria_receivable])
    end
    @criteria_receivable = session[:criteria_receivable]
    @receivables = Receivable.search_receivables(@criteria_receivable)

    @unpaid_orders = Order.find_all_by_is_paied('no')
---
SELECT * FROM "orders" WHERE ("orders"."is_paied" = 'no')