app/controllers/receivables_controller.rb

SELECT * FROM "receivables" ORDER BY date DESC, seq_no DESC
---
  def index
    @receivables = Receivable.all :order => 'date DESC, seq_no DESC'

SELECT * FROM "receivables" ORDER BY receivables.id DESC LIMIT 1
---
  def new
    @receivable = Receivable.new
    unless Receivable.last.blank?

SELECT * FROM "receivables" WHERE ("receivables"."id" = 29)
---
  def edit
    @receivable = Receivable.find(params[:id])