app/controllers/suppliers_controller.rb

  def index
    @suppliers = Supplier.all :order => 'seq DESC'
---
SELECT * FROM "suppliers" ORDER BY name

  def show
    @supplier = Supplier.find(params[:id])
---
SELECT * FROM "suppliers" WHERE ("suppliers"."id" = 1)

  def edit
    @supplier = Supplier.find(params[:id])
---
SELECT * FROM "suppliers" WHERE ("suppliers"."id" = 1)

  def create
    @supplier = Supplier.new(params[:supplier])

    respond_to do |format|
      if @supplier.save
---
INSERT INTO "suppliers" ("name", "seq_no", "updated_at", "created_at") VALUES('未定', 1, '2010-08-30 16:23:35.000000', '2010-08-30 16:23:35.000000') RETURNING "id"

  def update
    @supplier = Supplier.find(params[:id])
---
SELECT * FROM "suppliers" WHERE ("suppliers"."id" = 1)