app/controllers/users_controller.rb

SELECT * FROM "users" ORDER BY username
---
  def index
    @users = User.all :order => 'username'

INSERT INTO "users" ("name", "business_no", "company", "last_login_at", "updated_at", "last_request_at", "crypted_password", "current_login_ip", "username", "password_salt", "addtional", "current_login_at", "id_no", "cell_phone", "persistence_token", "login_count", "telephone", "address", "email", "created_at", "last_login_ip") VALUES('杨里佩', '', '', NULL, '2010-09-02 16:20:31.765000', NULL, '021cd72c7aaf9b34c48a457796052e8c107abc838ccd3bbfba500d8558920f23847d1573f43c9990f6ea35588de8f490133a9b0866e6e2f97443239371e8cea6', NULL, 'youngce', '0H1Mc0QqEJJwshSHB9Vi', '', NULL, '', '85262341170', '7fa5570242d8b291136072a850b1bcf4dd4d0f3f6ad4c1dd4abdaea4a77b119a18fbb3cbde376d882eece53ff2361cf368240de4481c439596777d1f64637a84', 0, '', '香港上环', 'lipei.yang@gmail.com', '2010-09-02 16:20:31.765000', NULL) RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if SchemaUtils.create_and_migrate_schema(get_schema(@user.username)) && @user.save

SELECT * FROM "users" WHERE ("users"."id" = 2)
---
  def update
    params[:user][:role_ids] ||= []
    @user = User.find(params[:id])